<h1>Localization Data Intern Test Report - Supercell</h1>

In [9]:
import sqlite3
import pandas as pd

# Create a SQL connection to our SQLite database
con = sqlite3.connect("./sample.sqlite")

# Create pandas dataframe from SQL database table account
sql_query_account = pd.read_sql_query ('''
                               SELECT
                               *
                               FROM account
                               ''', con)

df_account = pd.DataFrame(sql_query_account)

# Create pandas dataframe from SQL database table account_date_session
sql_query_account_date_session = pd.read_sql_query ('''
                               SELECT
                               *
                               FROM account_date_session
                               ''', con)

df_account_date_session = pd.DataFrame(sql_query_account_date_session)

# Create pandas dataframe from SQL database table iap_purchases
sql_query_iap_purchase = pd.read_sql_query ('''
                               SELECT
                               *
                               FROM iap_purchase
                               ''', con)

df_iap_purchase = pd.DataFrame(sql_query_iap_purchase)

# Close the connection
con.close()

In [6]:
# Create an overview of dataframes

df_account

,account_id,created_time,created_device,created_platform,country_code,created_app_store_id
0,13514010,2016-03-02 17:11:00.332,"iPhone6,2",iOS,GB,1
1,4308483975,2016-03-02 20:57:46.14,MIDC147PJ,Android,FR,2
2,17193137415,2016-03-02 13:52:16.735,SM-G360F,Android,IT,2
3,21488104920,2016-03-02 12:43:27.899,H60-L01,Android,CN,8
4,21488107995,2016-03-02 17:20:12.145,GT-I9500,Android,RU,2
...,...,...,...,...,...,...
112787,51554039942,2016-08-07 13:32:49.115,KOPO L128,Android,CN,4
112788,51554090637,2016-08-11 22:20:27.192,SM-G3608,Android,CN,15
112789,51554102314,2016-08-12 21:10:20.742,"iPhone8,4",iOS,US,1
112790,51554116380,2016-08-14 01:37:13.821,SM-G935F,Android,HR,2
112791,51554126520,2016-08-14 19:31:45.436,"iPad3,1",iOS,GB,1

In [10]:
df_account_date_session

          account_id        date  session_count  session_duration_sec
0        68730811144  2016-01-01              1                    47
1        68730812806  2016-01-01              1                   204
2        68730829426  2016-01-01             12                  4703
3        68730829426  2016-01-02              9                  4676
4        68730829426  2016-01-03              9                  2271
...              ...         ...            ...                   ...
1698969  55850490316  2016-12-30              1                   392
1698970  55850515956  2016-12-30              1                   564
1698971  55850515956  2016-12-31              9                  3268
1698972  55850519336  2016-12-31              9                  4043
1698973  55850528526  2016-12-31              1                   202

[1698974 rows x 4 columns]

In [11]:
df_iap_purchase

,account_id,created_time,package_id_hash,iap_price_usd_cents,app_store_id
0,30077202816,2016-03-26 23:59:59.355,ae0253c27c34edd1ab4fe21d6bfc91f8,739,0
1,30077202816,2016-05-31 11:24:37.283,dd4c1bda4f2c904075fb2fbfcf30f30e,369,0
2,21487283560,2016-02-13 03:40:28.644,99a9e0e63efa2fdce8fc8de74c66cea9,184,0
3,21487152816,2016-02-28 00:53:26.678,99a9e0e63efa2fdce8fc8de74c66cea9,184,0
4,8602037685,2016-02-11 01:03:04.727,99a9e0e63efa2fdce8fc8de74c66cea9,184,0
...,...,...,...,...,...
9904,51552698769,2016-07-23 03:25:58.87,99a9e0e63efa2fdce8fc8de74c66cea9,184,1
9905,51552698769,2016-07-25 05:57:33.827,99a9e0e63efa2fdce8fc8de74c66cea9,184,1
9906,51552698769,2016-11-14 01:01:11.202,efd2eebfdc98b55f9e6b45915d56f7ac,36,1
9907,51552698769,2016-12-02 13:43:30.761,efd2eebfdc98b55f9e6b45915d56f7ac,36,1
9908,64436338850,2016-10-09 01:42:58.696,efd2eebfdc98b55f9e6b45915d56f7ac,36,16

<h3>Question 1: Give us short description of datasets.</h3>

<p>